<?php
/**
 * SEO服务逻辑
 * @author Yangyang13 <yangyang13@leju.com>
 */
namespace Common\Logic;

class SeoLogic {
	public function __construct() {
		$this->_tag = (strpos($_SERVER['HTTP_HOST'], 'm.')!==false)  ? '手机乐居' : '乐居网';
	}

	//百科&词条首页
	public function index()
	{
		$seo = array();

		$seo['title'] = "乐居房产百科,房产词条-{$this->_tag}";
		$seo['keywords'] = '乐居房产百科,房产词条,房产知识,买房注意事项,购房指南';
		$seo['description'] = '乐居房产百科包含丰富的房地产知识，专业权威的房地产名词解释，房地产名人介绍，为您提供最新的买房新闻，房产政策，买房流程等购房知识最新信息，为业主购房支招，轻松了解房产专业内容。';

		return $seo;
	}

	//词条列表
	//传值是名人或百科,不传是全部
	public function llist($cateid = null)
	{
		$seo = array();

		if($cateid)
		{
			$name = array(0=>'名人',1=>'机构');

			$seo['title'] = "房产{$name[$cateid]}-房产百科-{$this->_tag}";
			$seo['keywords'] = "房产{$name[$cateid]},房产百科,房产知识,购房指南";
		}
		else
		{
			$seo['title'] = "乐居房产百科，房产词条-{$this->_tag}";
			$seo['keywords'] = '乐居房产百科,房产词条,房产知识,买房注意事项,购房指南';
		}
		$seo['description'] = '乐居房产百科包含丰富的房地产知识，专业权威的房地产名词解释，房地产名人介绍，为您提供最新的买房新闻，房产政策，买房流程等购房知识最新信息，为业主购房支招，轻松了解房产专业内容。';

		return $seo;
	}

	//词条详情
	public function wiki_detail($title, $content)
	{
		$seo = array();

		$seo['title'] = "{$title}-房产百科-{$this->_tag}";
		$seo['keywords'] = "{$title},房产百科,房产知识,购房指南";
		$seo['description'] = mb_substr(strip_tags($content), 0, 80, 'UTF-8');

		return $seo;
	}

	//知识详情
	//column:栏目 -线隔开
	//words:关键词 ,号隔开
	public function knowledge_detail($title, $column, $words, $content)
	{
		$seo = array();

		$seo['title'] = "{$title}-{$column}-房产百科-{$this->_tag}";
		$seo['keywords'] = "{$title},{$words}";
		$seo['description'] = mb_substr(strip_tags($content), 0, 80, 'UTF-8');

		return $seo;
	}

	//搜索结果页
	public function search($keyword)
	{
		$seo = array();

		$seo['title'] = "{$keyword}-房产百科-{$this->_tag}";
		$seo['keywords'] = "{$keyword},房产百科,房产知识,购房指南";
		$seo['description'] = '乐居房产百科包含丰富的房地产知识，专业权威的房地产名词解释，房地产名人介绍，为您提供最新的买房新闻，房产政策，买房流程等购房知识最新信息，为业主购房支招，轻松了解房产专业内容。';

		return $seo;
	}

	//知识&词条标签页
	public function tag($name)
	{
		$seo = array();

		$seo['title'] = "房产{$name}-房产百科-{$this->_tag}";
		$seo['keywords'] = "房产{$name},房产百科,房产知识,购房指南";
		$seo['description'] = '乐居房产百科包含丰富的房地产知识，专业权威的房地产名词解释，房地产名人介绍，为您提供最新的买房新闻，房产政策，买房流程等购房知识最新信息，为业主购房支招，轻松了解房产专业内容。';

		return $seo;
	}

	//知识栏目
	public function cate($l1, $l2)
	{
		$cate = array(
			//新房知识
			'1' => array(
				//准备买房
				'5' => array(
					'title'=>"准备买房知识,买房知识大全,买房注意事项 - 房产百科 - {$this->_tag}",
					'keywords'=>'买房准备知识,买房知识大全,买房注意事项',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的买房准备知识,买房知识大全,买房注意事项，包括买房资格，买房能力，买房政策，交易流程等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//看房选房
				'10' => array(
					'title'=>"看房选房知识,房产知识,看房注意事项,选房注意事项 - 房产百科 - {$this->_tag}",
					'keywords'=>'看房选房知识,房产知识,看房注意事项,选房注意事项',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的看房选房知识,房产知识,看房注意事项,选房注意事项，包括选新房技巧，新房户型，建筑面积，面积分类等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//认购新房
				'15' => array(
					'title'=>"认购新房知识,新房购买,如何购买新房,购买新房知识 - 房产百科 - {$this->_tag}",
					'keywords'=>'认购新房知识,新房购买,如何购买新房,购买新房知识',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的认购新房知识,新房购买,如何购买新房,购买新房等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//签约定房
				'18' => array(
					'title'=>"签约订房知识,签约买房,新房签约 - 房产百科 - {$this->_tag}",
					'keywords'=>'签约订房知识,签约买房,新房签约',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的签约订房知识,签约买房,新房签约，包括选交定金，资金托管，签约注意事项等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//贷款还款
				'20' => array(
					'title'=>"贷款还款知识,贷款买房,房屋贷款,贷款还款方式 - 房产百科 - {$this->_tag}",
					'keywords'=>'贷款还款知识,贷款买房,房屋贷款,贷款还款方式',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的贷款还款知识,贷款买房,房屋贷款,贷款还款方式，包括商业贷款知识，公积金贷款知识，个人贷款知识等。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//收房验房
				'25' => array(
					'title'=>"收房验房知识,收费验房注意事项,如何验房收房 - 房产百科 - {$this->_tag}",
					'keywords'=>'收房验房知识,收费验房注意事项,如何验房收房',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的收房验房知识,收费验房注意事项,如何验房收房，包括验房攻略，物业，退房，落户问题等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//退房维权
				'29' => array(
					'title'=>"退房维权知识,退房诉讼,退房违约金多少 - 房产百科 - {$this->_tag}",
					'keywords'=>'退房维权知识,退房诉讼,退房违约金多少',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的退房维权知识,退房诉讼,退房违约金多少，包括退房流程，退房绿色，退房攻略等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//产权归属
				'33' => array(
					'title'=>"产权归属知识,产权交易,产权维护 - 房产百科 - {$this->_tag}",
					'keywords'=>'产权归属知识,产权交易,产权维护',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的产权归属知识,产权交易,产权维护，包括产权归属如何确定，产权归属证明等知识。买房无忧，购房宝典尽在乐居房产百科！',
				)
			),
			//二手房知识
			'2' => array(
				//买房
				'64' => array(
					'title'=>"买二手房,买二手房注意事项,二手房知识 - 房产百科 - {$this->_tag}",
					'keywords'=>'买二手房,买二手房注意事项,二手房知识',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的买二手房,买二手房注意事项,二手房知识，包括买二手房需要注意什么，买二手房方法，买二手房交税等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//卖房
				'65' => array(
					'title'=>"卖二手房,出售二手房注意事项,如何出售二手房 - 房产百科 - {$this->_tag}",
					'keywords'=>'卖二手房,出售二手房注意事项,如何出售二手房',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的卖二手房,出售二手房注意事项,如何出售二手房，包括买二手房需要注意什么，买二手房方法，买二手房交税等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//租房
				'66' => array(
					'title'=>"租房知识,二手房出租,租房注意事项 - 房产百科 - {$this->_tag}",
					'keywords'=>'租房知识,二手房出租,租房注意事项',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的租房知识,二手房出租,租房注意事项。买房无忧，购房宝典尽在乐居房产百科！',
				)
			),
			//家居知识
			'3' => array(
				//设计
				'37' => array(
					'title'=>"家居知识,家居设计,家居常识 - 房产百科 - {$this->_tag}",
					'keywords'=>'家居知识,家居设计,家居常识',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的家居知识,家居设计,家居常识，包括家居设计效果，家居设计大全，家居设计方案等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//主材
				'41' => array(
					'title'=>"家居主材,主材挑选注意事项,主材分类 - 房产百科 - {$this->_tag}",
					'keywords'=>'家居主材,主材挑选注意事项,主材分类',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的家居主材,主材挑选注意事项,主材分类，包括如何挑选家居主材，主材有哪些，主材价格等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//施工
				'51' => array(
					'title'=>"家装施工,施工方案,施工流程 - 房产百科 - {$this->_tag}",
					'keywords'=>'家装施工,施工方案,施工流程',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的家装施工,施工方案,施工流程，包括家居装修施工流程，家居装修施工注意事项等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//攻略
				'58' => array(
					'title'=>"家居攻略,家居实用攻略 - 房产百科 - {$this->_tag}",
					'keywords'=>'家居攻略,家居实用攻略',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的家居攻略,家居实用攻略。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//风水
				'61' => array(
					'title'=>"家居风水,家居风水禁忌大全,家居风水知识大全 - 房产百科 - {$this->_tag}",
					'keywords'=>'家居风水,家居风水禁忌大全,家居风水知识大全',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的家居风水,家居风水禁忌大全,家居风水知识大全，包括家居风水布局摆设，家居风水禁忌等知识。买房无忧，购房宝典尽在乐居房产百科！',
				)
			),
			//装修知识
			'4' => array(
				//瓦木
				'88' => array(
					'title'=>"瓦木知识,装修知识,装修知识大全 - 房产百科 - {$this->_tag}",
					'keywords'=>'瓦木知识,装修知识,装修知识大全',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的瓦木知识,装修知识,装修知识大全，包括瓦木验收标准,验收注意事项等知识。买房无忧，购房宝典尽在乐居房产百科！',
				),
				//施工
				'84' => array(
					'title'=>"装修施工,装修施工流程,装修施工注意事项 - 房产百科 - {$this->_tag}",
					'keywords'=>'装修施工,装修施工流程,装修施工注意事项',
					'descriptions'=>'乐居网新房知识准备买房栏目，为您提供最新最全的装修施工,装修施工流程,装修施工注意事项，包括装修准备，拆改，水电，泥木，油漆等知识。买房无忧，购房宝典尽在乐居房产百科！',
				)
			)
		);

		if(isset($cate[$l1][$l2]))
		{
			return $cate[$l1][$l2];
		}
		else
		{
			//l1和l2有误时的一个打底数据
			return $this->index();
		}

	}
}