<?php
/**
 * 应用接口配置
 *
 */

$api_config = array(
	// 定义 api 接口异常输出模版
	'TMPL_EXCEPTION_FILE' => WEB_ROOT.APP_NAME.'/View/exception.tpl',
	// 应用 Token 过期时间长度, 单位 second
	'EXPIRE_VAL' => 1296000, // 15*24*60*60 即 15 天

	// 错误代码
	'ERR_CODE' => array(
		// 通用部份
		10001 => '未提供 Access Token 信息',
		10002 => 'Access Token参数不完整',
		10003 => 'AccessToken 已经失效',
		// Token 接口
		10100 => 'token方法:参数不完整',
		10101 => '应用编号错误',
		10102 => 'token方法:密钥不完整',
		10103 => 'token方法:应用密钥错误',
		// Search 接口
		10201 => 'search方法:没有指定关键词',
		10202 => 'search方法:指定的业务不存在或无权限',
		// Get 接口
		10401 => 'get方法:没有指定主键编号',
		10402 => 'get方法:没有找到指定的数据',
		// Push 接口
		10501 => 'push方法:没有推送数据',
		10502 => 'push方法:数据格式有问题，或数据不完整',
		10503 => 'push方法:没有指定的索引定义',
		10504 => 'push方法:没有指定的类型定义',
		10505 => 'push方法:未设置ID规则',
		10506 => 'push方法:数据参数格式错误',
		10507 => 'push方法:数据参数不完整',
		10508 => 'push方法:核心数据参数格式错误',
		10509 => 'push方法:批量导入数据量超出限制',
		10510 => 'push方法:业务是只读的，不能进行数据推送操作',
		// Callback 接口
		11001 => 'callback方法:业务不支持数据消息推送回调',
		11002 => 'callback方法:数据内容不完整',
		11003 => 'callback方法:来源数据源适配器未定义',
		11004 => 'callback方法:目标数据源适配器未定义',
		11005 => 'callback方法:数据同步错误',
	),
);

return $api_config;